{
    "promp": "Photorealistic, ultra-high-resolution (4K) lifestyle photograph of two young adult women (approx. 22--28) standing closely together in a stylized indoor--outdoor penthouse setting, framed vertically and captured from a distinctly low, rear-biased three-quarter angle that prioritizes the slim hourglass silhouette, hip width, and glute projection, while still keeping both faces visible in an over-the-shoulder glance. The camera is positioned slightly below hip level and angled upward, producing dominant lower-body emphasis with mild perspective exaggeration. Left subject (Japanese): fair skin with porcelain undertones; platinum blonde hair, straight and glossy, worn fully down the back with a center part; delicate almond-shaped eyes, soft features, and a straight nose; expression calm and confident as she looks directly toward the camera over her shoulder. Right subject (Taiwanese): fair skin; silver hair with distinct purple tips, straight and smooth; cute features, bright eyes with long lashes, a small nose, and a playful smile as she glances sideways toward the camera. Accessories/markings: subtle everyday makeup. Body type and proportions: both women have slim hourglass figures with distinct waist-to-hip ratios, characterized by slim waists contrasting against curvy, rounded hips and projected glutes. Approximate proportions--left subject ~34--23--36, right subject ~33--22--35; estimated height 165--170 cm. Gluteal anatomy is shapely: sagittal depth visible with under-glute curvature transitioning smoothly into the thighs; waist depth creates an accentuated S-curve from the rear three-quarter perspective. Pose specifics (locked): both stand upright with hips pushed back and pelvis slightly tilted; torsos subtly twisted toward the camera; left subject's right arm wraps securely around the right subject's lower back/hip; right subject's left arm bends naturally at her side; shoulders relaxed; legs straight but soft at the knees, weight set into the heels.",
    "Clothing": "(bikinis): both wear high-cut, cheeky bikini bottoms that ride high on the hips. The Japanese subject wears a solid white minimalist bikini with a thin-strap triangle top; the Taiwanese subject wears a purple bikini with a simple bandeau or triangle top. Swim fabric is smooth, matte, and snug, with clean edges and no logos. Background/environment (distinct and unique): a modern penthouse lounge transitioning into an indoor pool or spa area--polished concrete or stone flooring, a low-profile sectional sofa partially visible behind them, floor-to-ceiling glass panels with sheer curtains diffusing daylight, and subtle architectural lighting strips along the ceiling or wall edges. A hint of greenery (potted palm or sculptural plant) adds contrast. The space feels upscale, airy, and editorial rather than domestic. Lighting: strong diffused daylight filtered through sheer curtains combined with soft architectural ambient lighting, creating smooth highlights across hair, shoulders, and upper backs, and deeper, natural shadows beneath the glutes to reinforce depth and shape. Image qualities: razor-sharp focus, realistic skin texture with pores and natural tonal variation, accurate swimwear fabric tension, neutral color grading, no filters--high-fidelity, editorial realism with a clearly differentiated setting while preserving the original pose and camera geometry. 3:4"
}
