{
  "meta": {
    "aspect_ratio": "2:3",
    "quality": "ultra_photorealistic",
    "resolution": "8k",
    "camera": "iPhone 15 Pro Max, Main Lens, RAW Mode",
    "style": "Authentic mobile photography, candid winter snapshot, bright natural daylight, high texture fidelity, unedited raw look with natural grain, perfect vertical composition."
  },
  "subject": {
    "identity": "A stunning young woman with long wavy platinum blonde hair and deep blue eyes.",
    "face_details": {
      "eyes": "Light blue, squinting slightly due to the bright sun, looking off to the side.",
      "skin": "Light tone, natural texture with visible pores and slight freckles across the nose, rosy cheeks from the cold.",
      "expression": "Thoughtful and alluring, with her right index finger gently touching her lower lip.",
      "hair": "Platinum blonde, styled in two messy high buns (space buns) with loose, wavy strands framing her face."
    },
    "body": {
      "pose": "Standing straight on a snowy balcony, angled slightly to show her defined, voluptuous hourglass figure and athletic proportions.",
      "hands": "Right hand raised near her mouth, left arm relaxed by her side, partially holding the draped jacket."
    },
    "outfit": {
      "bodysuit": "A form-fitting, light blue ribbed knit bodysuit that conforms tightly to her curves.",
      "jacket": "An oversized beige faux fur jacket, draped loosely off her shoulders and held by her arms.",
      "legwear": "Thick white knit leg warmers, slouched realistically around her calves and ankles."
    }
  },
  "environment": {
    "location": "A snow-covered balcony on a bright, clear winter day.",
    "background_elements": [
      "White metal balcony railing in the foreground, covered in a thick layer of fresh snow.",
      "A dense forest of bare, snow-dusted trees in the distance under a clear, vibrant blue sky.",
      "Deep, untouched snow covering the ground below the balcony level."
    ]
  },
  "lighting": {
    "source": "Bright, harsh, direct natural sunlight coming from the upper right, casting distinct, sharp shadows.",
    "quality": "Creates strong highlights on her skin, hair, and the crystalline snow, emphasizing the cold, crisp atmosphere."
  },
  "realism_focus": {
    "textures": "Incredible tactile detail on the ribbed knit fabric, soft faux fur fibers, knit patterns of the leg warmers, individual hair strands, and the powdery texture of the snow.",
    "imperfections": "Natural film grain, authentic lens flare from the bright sun, and realistic skin texture without any artificial smoothing."
  }
}