{
  "meta": {
    "aspect_ratio": "3:4",
    "quality": "ultra_photorealistic, raw, unedited photograph",
    "resolution": "8k",
    "camera": "Full-frame mirrorless camera",
    "lens": "35mm f/1.4 prime lens",
    "style": "Candid outdoor snapshot, harsh natural sunlight, true-to-life colors, zero post-processing look",
    "composition": "Medium shot, eye-level outdoor photograph capturing a woman from the mid-thigh up."
  },
  "scene": {
    "location": "Sunny tropical resort courtyard",
    "environment": [
      "Textured stone paver ground with natural wear in the foreground",
      "Dense green tropical foliage including palm fronds and flowering oleander bushes directly behind the subject",
      "Multi-story resort building architecture with cream stucco walls, dark wooden balconies with railings, and exposed dark wood roof eaves in the background",
      "Bright blue sky visible in the upper right corner"
    ],
    "time": "Mid-day, high sun",
    "atmosphere": "Hot, bright, humid summer day"
  },
  "lighting": {
    "type": "Harsh, direct natural sunlight",
    "source": "Sun overhead",
    "effect": "High contrast lighting creating strong, definitive shadows under the balcony and plants. Intense specular highlights on the subject's wet hair, tanned skin, and the white bikini fabric. Slightly overexposed highlights due to intense brightness."
  },
  "subject": {
    "identity": "A tanned woman with platinum blonde, heavily wet, wavy hair hanging down her back.",
    "body": {
      "pose": "Standing, body turned slightly to the left, looking back over her left shoulder directly at the camera. Her right arm is raised, with her hand running through her wet hair near the top of her head.",
      "physique": "Slender, toned build with a deep tan."
    },
    "outfit": {
      "clothing": "White string bikini. The bikini features small rectangular gold hardware links connecting the straps on the hips and on the triangle top straps."
    }
  },
  "realism_focus": {
    "textures": "Tangible, raw textures: individual wet hair strands sticking together clumping, realistic skin texture with pores and sun exposure details, the woven texture of the bikini fabric, rough stone ground, waxy leaf surfaces.",
    "imperfections": "Natural skin flaws, slight squinting around the eyes due to bright sun, realistic harsh shadows, unpolished 'raw photo' finish rather than a studio-perfect look."
  }
}