{
  "scene": {
    "description": "Ultra-photorealistic candid golden hour photo in a cozy gaming bedroom. A young woman is sitting at her computer desk playing with a PS5 controller, both bare feet casually propped up and crossed on the desk. Natural golden hour sunlight. Amateur iPhone snapshot feel.",
    "environment": {
      "location": "sunlit gaming bedroom – golden hour",
      "elements": [
        "computer desk with monitor (screen off or dark)",
        "gaming chair pushed back",
        "window letting in warm golden sunlight",
        "minimal background – bed or posters visible"
      ],
      "lighting": "pure natural golden hour sunlight from side/back – rich warm glow, soft rim light on hair, legs and skin, long natural shadows"
    },
    "photography": {
      "camera_style": "amateur iPhone photo taken by someone else – candid, slight handheld camera shake, minor motion blur on hair strands and controller hand, slightly crooked framing, imperfect composition, casual snapshot vibe",
      "angle": "side/three-quarter view, slightly low to capture crossed bare feet clearly",
      "shot_type": "very candid relaxed golden hour gaming moment – feels quickly snapped",
      "aspect_ratio": "9:16 vertical",
      "texture": "hyper-realistic skin with golden hour warmth, fabric details, hair highlights, natural imperfections, light film grain"
    }
  },
  "subject": {
    "appearance": {
      "age_range": "early to mid 20s",
      "gender": "female",
      "build": "slim yet curvy with soft feminine proportions",
      "skin": "fair skin with warm golden-hour glow",
      "face": "soft facial structure, full lips, delicate nose, naturally defined cheekbones",
      "eyes": "light-colored eyes",
      "hair": "platinum blonde or very light blonde hair, messy low ponytail or loose bun, face-framing strands, relaxed bedhead texture"
    },
    "pose": {
      "overall": "sitting relaxed in gaming chair at desk, both legs extended with bare feet propped up on the edge of the desk, ankles comfortably crossed",
      "legs": "both feet up on desk, ankles crossed, toes relaxed and clearly visible",
      "feet": "barefoot, perfectly pedicured with glossy black nail polish on toes, well-groomed and prominent in frame",
      "arms": "both hands holding black PS5 DualSense controller in lap, playing actively",
      "torso": "relaxed lean back, midriff fully exposed"
    },
    "expression": {
      "eyes": "slightly lowered eyelids, relaxed gaze",
      "mouth": "lips very slightly parted",
      "emotion": "natural, calm, subtly intimate"
    },
    "clothing": {
      "top": "white ribbed cropped tank top with thick athletic straps and high neckline",
      "bottom": "very short fitted shorts"
    },
    "accessories": {
      "headphones": "pastel pink over-ear headphones",
      "controller": "black PS5 DualSense controller"
    }
  },
  "requirements": [
    "Single female subject only",
    "Both bare feet must be visible and propped up on the desk with ankles crossed",
    "Feet positioned closer to camera than face",
    "Glossy black pedicure on toes clearly visible",
    "Pastel pink over-ear headphones worn on head"
  ]
}
