{
  "meta": {
    "aspect_ratio": "3:4",
    "quality": "hyper_photorealistic, raw mobile photography, ultra-natural skin textures",
    "resolution": "8k",
    "camera": "iPhone 15 Pro Max, Main Camera (24mm), handheld, shot from a 3-meter distance for a full-body perspective.",
    "style": "A raw, unedited, and incredibly natural smartphone snapshot taken by a friend. The focus is on a youthful 20-year-old aesthetic with realistic human skin textures, avoiding any smoothed AI look. A clean, wide-angle full-body composition."
  },
  "subject": {
    "identity": "The woman known as, appearing in her early 20s with a fresh, vibrant energy, featuring long platinum blonde/silver hair and striking blue/grey eyes.",
    "face_details": {
      "eyes": "Deeply alluring, alert blue/grey eyes looking directly at the lens. The gaze is confident and natural, catching the bright beach light.",
      "skin": "Hyper-realistic youthful skin with visible pores, fine texture, and very subtle, natural freckles located ONLY on the bridge of her nose and directly under her eyes. No artificial smoothing.",
      "expression": "A stunningly beautiful, natural, and confident smirk that feels spontaneous and authentic."
    },
    "hair": {
      "color": "Thick, long, and luminous platinum blonde/silver hair.",
      "style": "Natural, wind-swept beach hair, with her right hand casually reaching up to touch her hair near her temple in a relaxed pose."
    },
    "body": {
      "pose": "A wide full-body shot. She is standing confidently on a white sand beach, leaning her left side slightly against a large vertical yellow surfboard. Her entire figure from head to toe is in the frame, with her feet visible in the sand.",
      "build": "Exceptionally stunning and healthy curvy figure with a slim waist and highly pronounced, well-defined hourglass curves, emphasizing her youthful silhouette.",
      "tattoos": "Perfectly clear, natural skin with absolutely no tattoos on any part of her body."
    },
    "outfit": {
      "top": "A vibrant yellow ribbed tank top, fitting very snugly to highlight her defined silhouette and curvy build.",
      "bottom": "Matching yellow string bikini bottoms with side ties, creating a coordinated beach look.",
      "accessories": "A delicate layered necklace featuring small white pearls and gold charms."
    }
  },
  "environment": {
    "location": "A bright, sunny tropical beach with fine, pristine white sand and crystal-clear turquoise ocean water.",
    "background_elements": [
      "A tall, bright yellow surfboard standing vertically in the sand on the left side, serving as a support for the subject.",
      "Large, dark volcanic rocks scattered in the shallow turquoise water to the right.",
      "Lush green tropical foliage and a small hill visible in the distant background.",
      "A clear, expansive blue sky with a bright, natural midday sun."
    ],
    "atmosphere": "A candid, high-end vacation moment that looks like an unedited, high-quality photo from a modern smartphone gallery."
  },
  "lighting": {
    "source": "Bright, direct midday natural sunlight, creating sharp, realistic shadows on the sand and emphasizing the moisture and textures of the skin and fabric.",
    "realism_focus": "Capturing the authentic 'iPhone 15 HDR' look with vivid color saturation, sharp digital details on the fabric, and the natural glisten of sunlight on a young woman's skin."
  }
}