{
  "subject": {
    "description": "Beautiful young Japanese woman with long, straight platinum blonde hair, center-parted, fair skin tone with soft Japanese facial features, athletic full hourglass figure, glamorous makeup with defined brows, sharp eyeliner, long lashes, and glossy nude-pink lips.",
    "pose": "Standing confidently in front of a plain wall, taking a mirror selfie, right hand on hip, left hand holding phone (not visible), body slightly angled, weight on one leg creating a natural curve to emphasize an athletic hourglass silhouette.",
    "expression": "Direct eye contact with the camera, subtle pout, confident and seductive gaze."
  },
  "clothing": {
    "outfit": "Tight-fitting one-shoulder ribbed bodysuit in white color, high-cut leg design, deep side cut exposing hip, form-fitting and stretchy material that accentuates curves, minimalistic yet very revealing.",
    "details": "Ribbed texture visible across the entire garment, clean minimalist aesthetic."
  },
  "environment": {
    "setting": "Modern minimalist indoor space (bedroom or dressing area)",
    "background": "Plain dark gray/black wall on one side, light-colored wall/door frame on the other, subtle shadow cast by body, no distracting elements."
  },
  "lighting": {
    "type": "Soft, even indoor lighting (likely natural window light + soft artificial fill)",
    "quality": "Flattering and smooth, gentle highlights on skin and fabric, minimal harsh shadows, emphasizing body contours."
  },
  "camera_specifications": {
    "angle": "Straight-on mirror selfie perspective (slightly low angle)",
    "framing": "Full-body shot from mid-thigh up, including head and feet",
    "focus": "Sharp focus on subject, slight background blur",
    "lens_suggestion": "35mm or 50mm equivalent (smartphone portrait mode)"
  },
  "styling_and_mood": {
    "aesthetic": "Modern luxury, clean minimalism, confident sensuality",
    "mood": "Empowered, seductive, bold, contemporary glamour"
  },
  "technical_modifiers": [
    "Ultra Photorealistic",
    "8k resolution",
    "Raw photo",
    "Hyper-detailed skin and ribbed fabric texture",
    "Subsurface scattering on skin",
    "Natural indoor lighting",
    "Sharp focus with shallow depth of field",
    "High contrast on body contours"
  ]
}