{
  "prompt_structure": {
    "subject": {
      "demographics": "Young adult female, approx 20-25 years old.",
      "appearance": "Fair porcelain skin tone, soft and smooth texture. Long, dark black hair styled in loose, voluminous waves cascading down the back and over the left shoulder. High cheekbones, full lips, and a straight nose.",
      "distinctive_marks": "Small, delicate script tattoo located on the upper left chest/collarbone area.",
      "gaze": "Looking away from the camera, gazing intently out of a window to the left."
    },
    "attire": {
      "item": "Two-piece sleepwear/lounge set (spaghetti strap camisole top and matching shorts).",
      "design": "All-over retro pop-art comic book print. The pattern features comic strip panels, speech bubbles with text, and illustrative character faces.",
      "colors": "White base fabric with vibrant graphic prints in red, cyan blue, yellow, and black outlines.",
      "fit": "Comfortable, semi-fitted, showing natural fabric folds around the waist and bust."
    },
    "pose_and_gesture": {
      "stance": "Standing upright in a three-quarter profile view facing left.",
      "arms": "Protective/contemplative posture; right arm hangs loosely while the left hand crosses the torso to hold the right arm/elbow.",
      "reflection": "The subject's back and hair are clearly reflected in the glass window pane to her left."
    },
    "environment": {
      "location": "Modern interior, likely a bedroom or living area.",
      "key_elements": "Large floor-to-ceiling glass window or sliding door with a thick, matte black frame.",
      "background": "A plain, neutral off-white or light gray wall behind the subject. The interior is minimal and uncluttered."
    },
    "lighting": {
      "source": "Natural daylight diffused through the window.",
      "direction": "Side lighting coming from the left.",
      "quality": "Soft and flattering, highlighting the facial features and the curve of the body while casting gentle, natural shadows on the right side (away from the window)."
    },
    "mood_and_atmosphere": {
      "vibe": "Introspective, serene, quiet, slightly melancholic, morning calm.",
      "emotional_tone": "Pensive and dreamy."
    },
    "camera_and_technical": {
      "style": "Ultra-photorealistic, cinematic portrait photography.",
      "lens": "85mm portrait lens.",
      "aperture": "f/2.8 for a shallow depth of field, keeping the subject sharp while softly blurring the background wall.",
      "resolution": "8k, high definition.",
      "details": "Hyper-realistic skin texture (pores, peach fuzz), accurate fabric physics, realistic light refraction in the window glass, ray-traced reflections."
    }
  }
}